# Python HW2 Working with Pandas and SQLAlchemy

In [1]:
import pandas as pd
from flask_sqlalchemy import SQLAlchemy
from sqlalchemy import create_engine
from config import username, password

CONNECT TO THE MYSQL DATABASE

In [2]:
engine = create_engine(f'mysql+pymysql://{username}:{password}@localhost/dogs_db')

READING CSV FILE WITH DOGS AND OWNERS INFO

In [ ]:
dogs_df=pd.read_csv('dogs.csv')
owners_df=pd.read_csv('owners.csv')

LOADING DATAFRAMES TO MYSQL TABLES

In [ ]:
dogs_df.to_sql('dogs',engine,if_exists='append',index=False)
owners_df.to_sql('owners',engine,if_exists='append',index=False)

READING DATAFRAMES FROM MYSQL TABLES

In [3]:
owners_df = pd.read_sql_table('owners',engine)
dogs_df = pd.read_sql_table('dogs',engine)

EXPLORE THE FIRST 5 ROWS OF THE DATAFRAMES

In [4]:
dogs_df.head()

   id    name             breed  age   sex
0   1   Bella         Chihuahua    2  girl
1   2  Autumn    Boston Terrier    4  girl
2   3  Bailey         Chow Chow    1   boy
3   4  Summer  Golden Retriever    3  girl
4   5   Benji               Lab    4   boy

In [5]:
owners_df.head()

   id              name  dog_id
0   1        Adam Baker       2
1   2       Donna Brown       3
2   3  Anthony Campbell       5
3   4         Emma Bond      14
4   5       Dorothy Lee      11

SHOW RECORDS COUNT PER TABLE (rows, columns)

In [6]:
dogs_df.shape

(19, 5)

In [19]:
dogs_df['id'].count()

19

In [7]:
owners_df.shape

(10, 3)

In [21]:
owners_df['id'].count()

10

SHOW HOW MANY DOGS WE HAVE BY BREED

In [16]:
dogs_df['breed'].value_counts()

Golden Retriever    2
Rottweiler          2
Collie              2
French Bulldog      2
Chihuahua           1
German Shepherd     1
Lab                 1
Corgi               1
Bulldog             1
Doberman            1
Chow Chow           1
Dachshund           1
Poodle              1
Boston Terrier      1
Shih Tzu            1
Name: breed, dtype: int64

In [ ]:
HOW MANY UNIQUE BREEDS DO WE HAVE?

In [15]:
dogs_df['breed'].nunique()

15

In [ ]:
SHOW THE OWNERS AND THE DOGS THEY ADOPTED

In [14]:
pd.merge(dogs_df,owners_df,how='inner',left_on='id',right_on='dog_id')

   id_x   name_x           breed  age   sex  id_y            name_y  dog_id
0     1    Bella       Chihuahua    2  girl     8      Jason Powell       1
1     2   Autumn  Boston Terrier    4  girl     1        Adam Baker       2
2     3   Bailey       Chow Chow    1   boy     2       Donna Brown       3
3     5    Benji             Lab    4   boy     3  Anthony Campbell       5
4     6    Spike        Shih Tzu    5   boy     7       Jake Wilson       6
5     8    Oscar       Dachshund    2   boy     6      Maria Walker       8
6    11  Scooter      Rottweiler    1   boy     5       Dorothy Lee      11
7    12    Sugar           Corgi    2  girl    10   Stephen Wallace      12
8    14     Joey         Bulldog    3   boy     4         Emma Bond      14
9    19    Roxie          Collie    3  girl     9       Kate Russel      19